(*
  1.	Множества задаются неупорядоченными списками своих элементов (без повторений). Определите функции:
  a)	объединения множеств:
  setunion([9,2,7],[3,2])=[9,2,7,3]
  b)	пересечения множеств:
  setintersection([9,2,7],[3,2])=[2]
*)

(*
  2.	Определите функцию, меняющую местами заданные элементы списка:
  exchange([3,2,5,1],1,3) = [5,2,3,1]
*)


(*
  3.	Определите функцию, по данному списку элементов строящую список пар вида (элемент, число вхождений в список):
  stat([“a”,“b”,“b”,“c”,“b”,“a”]) = [(“a”,2),(“b”,3),(“c”,1)]
*)